app/Controllers/RestApi.php

INSERT INTO `pedidos` (`nombre_cliente`, `fecha_pedido`) VALUES ('fonseca', '2022-05-06')
INSERT INTO `pedidos_detalle` (`id_pedido`, `id_producto`) VALUES (18, '1')
---
    public function create()
    {
        $producto = new ProductosModel();
        $pedidos = new PedidosModel();
        $detallePedidos = new detallePedidosModel();

        $d = new DateTime();
        // echo $d->format('Y-m-d');
        $id = $pedidos->insert([
            'nombre_cliente' => $this->request->getPost('nombre_cliente'),
            'fecha_pedido' =>  $d->format('Y-m-d')
        ]);
        //
        $listaPedidos = '';
        if (isset($_POST['pd'])) {
            foreach ($_POST['pd'] as $valor) {
                $listaPedidos = $listaPedidos . '' . $valor;
                $id_pedidos = $detallePedidos->insert([
                    'id_pedido' => $id,
                    'id_producto' =>  $valor
                ]);